app/Controllers/ProductController.php

    public function index(){
        $model = new Product_Model();
        $categoria = new Categoria_Model();
        $dato['categorias'] = $categoria->orderBy('categoria_id', 'DESC')->findAll();
        $dato['productos'] = $model->orderBy('producto_id', 'DESC')->findAll();
---
SELECT *
FROM `producto`
ORDER BY `producto_id` DESC

    public function actualizar($id = null)
    {
        $productModel = new Product_Model();

        // Validación de campos
        $validation = $this->validate([
            'nombre_prod' => 'required|min_length[3]|max_length[60]',
            'precio' => 'required|numeric',
            'descripcion' => 'max_length[50]',
            'stock' => 'required|numeric',
        ]);

        $id = $this->request->getVar('producto_id');
        $data['producto'] = $productModel->where('producto_id', $id)->first();
---
SELECT *
FROM `producto`
WHERE `producto_id` = '31'
 LIMIT 1