app/Controllers/VentasController.php

        public function ventas(){
            $session = session();
            $id=$session->get('id');
            $perfil=$session->get('perfil_id');

            $ventasModel = new Ventas_Model();


            if ($perfil == '1') { // Si es administrador
                $data['ventaDetalle'] = $ventasModel->getDetalles(); // Obtener todas las ventas
            } else if ($perfil == '2') { // Si es cliente
                //Obtener las compras del cliente
                $data['ventaDetalle'] = $ventasModel->where('id_cliente', $id)->orderBy('id', 'DESC')->findAll();
---
SELECT *
FROM `venta`
WHERE `id_cliente` = '17'
ORDER BY `id` DESC