app/Models/DetalleVenta_Model.php

    public function getDetalles($id = null, $id_usuario = null) {
        $db = \Config\Database::connect();
        $builder = $db->table('detalle_venta'); // Crear una instancia de QueryBuilder

        $builder->select('*');
        $builder->join('venta', 'venta.id = detalle_venta.id_venta');
        $builder->join('producto', 'producto.producto_id = detalle_venta.id_producto');
        $builder->join('users', 'users.id_persona = venta.id_cliente');

        if ($id !== null) {
            $builder->where('venta.id', $id);
        }

        $query = $builder->get();
---
SELECT *
FROM `detalle_venta`
JOIN `venta` ON `venta`.`id` = `detalle_venta`.`id_venta`
JOIN `producto` ON `producto`.`producto_id` = `detalle_venta`.`id_producto`
JOIN `users` ON `users`.`id_persona` = `venta`.`id_cliente`
WHERE `venta`.`id` = '45'